{
    "blogs":[
    {
        "id": "blog1", 
        "title": "HTML, CSS, Git, Github", 
        "date": "02/27/18", 
        "post": "For the first few classes, I was introduced to HTML,CSS,Git and Github. There is nothing special or new when talked about HTML and CSS in terms of what tags to use or how to stype the HTML page. However, what is new and really useful to me is the way Zoe did the first Zen-Garden project. She spent decent amount of time went throught the HTML layout then start doing the CSS. The work and logic flow is really clear this way. Moreover, I was also introduced to a new technology that is really powerful and useful -- Git and Github. They are version control technology. However, it is kind of difficult to understand at the first time since there is no user interface. It is very important to understand the logic behind each command"
    },
    {
        "id": "blog2", 
        "title": "JS", 
        "date": "03/06/18", 
        "post": "This week, I was introduced to JavaScript. This is where we start making the website interactive. It involves concept of objects which I did not fully understand when I did my NSS preworks. After Zoe explained the basic concept and I worked through some challenge questions. It starts making more sense to me now."
    },
    {
        "id": "blog3", 
        "title": "Advanced JS", 
        "date": "03/13/18", 
        "post": "This week, I was introduced more advanced javaScript techniques which involves looping through arrays,objects and creating custom functions. Function makes my codes more orgnized and clean, and I do not have to worry about the scope of variables. Before I know how to use the function, I had variable decleared all over the places cross the js file. Sometimes I forgot what I already declared and re-declare the varible which gave me a lof troubles. With function, whatever variable I declared only exist in the scope of current function. When I jump into other functions, I do not have to worry about what variable name I should use in order to prevent re-declaring variable"
    },
    {
        "id": "blog4", 
        "title": "ES6, DOM Interaction, and markdown", 
        "date": "03/25/18", 
        "post": "This week, they were talking about ES6, DOM Interaction, and markdown. ES6 is pretty straight forward to me. It is just different syntax from ES5. Nothing special to talk about. However, DOM interaction is not that easy, especially the DOM traversing. When I watched the pre-work Tree-house toturial for this part, I was completely lost about what this thing is doing. Fortunately, when Collan went through this with an exmaple in class, and I went back to watch the tutorials again. It is now make perfect sense to me. DOM traversing is really useful when I deal with multiple elements that need to match up to each other. I can ulterlize the relationship between the elements to find whatever I am looking for."
    },
    {
        "id": "blog5", 
        "title": "XHR", 
        "date": "04/01/18", 
        "post": "This week, I was introduced a new important component of web development -- XHR. When I was watching the treehouse tutorial, it was bit of confusing. Especially the JSON concept. I was not able to disguish the difference between JSON format and other Javascript objects format. They just looked like the same. But now, it is really clear that the key of objects in JSON file must be quoted using double quote. For XHR, it is pretty straight forward. 1. Declare a new instance of XHR 2. Add eventlisteners to XHR for both success and failure of XHR execution. 3. Open data source which are JSON files in this case. 4. Send the request. The only difficult thing about this XHR concept is that the returned value is only available in the scope of the function that is being called, which means if there are multiple funtions that needs the data, then the XHR has to be created multiple times. Sometime it is kind of difficult to create it and get the data when working along with other codes"
    }
  ]
}